<a href="https://colab.research.google.com/github/iszewczuk/pandas_exercises_my/blob/main/US_Baby_Names.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [7]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [8]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(url, delimiter=',')

### Step 4. See the first 10 entries

In [9]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [10]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

### Step 6. Is there more male or female names in the dataset?

In [11]:
gender_counts = baby_names.groupby('Gender').size()
gender_counts

Gender
F    558846
M    457549
dtype: int64

### Step 7. Group the dataset by name and assign to names

In [12]:
names = baby_names.groupby('Name')
names.head()

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1004923  Gryffin  2014      M    WI      5
1004950     Kroy  2014      M    WI      5
1004973     Owyn  2014      M    WI      5
1005707   Haylea  2005      F    WV      5
1012216  Coalton  2012      M    WV      7

[65502 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [13]:
num_names = baby_names['Name'].nunique()
num_names

17632

### Step 9. What is the name with most occurrences?

In [15]:
name_counts = baby_names.groupby('Name')['Count'].sum()
most_common_name = name_counts.sort_values(ascending=False).head(1)
print(most_common_name.index[0], most_common_name.values[0])

Jacob 242874

### Step 10. How many different names have the least occurrences?

In [18]:
min_count = name_counts.min()
num_least_common_names = (name_counts == min_count).value_counts()[True]
num_least_common_names

2578

### Step 11. What is the median name occurrence?

In [17]:
name_counts = baby_names.groupby('Name')['Count'].sum()
median_name_occurrence = name_counts.median()
median_name_occurrence

49.0

### Step 12. What is the standard deviation of names?

In [19]:
name_counts = baby_names.groupby('Name')['Count'].sum()
name_occurrence_std = name_counts.std()
name_occurrence_std

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [20]:
summary_stats = baby_names.describe()

In [21]:
summary_stats

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03